

const config = {
  "name": "treov2",
  "aliases": ["tpv2"],
  "description": "",
  "usage": "",
  "cooldown": 3,
  "permissions": [2],
  "credits": "Dwen",
  "extra": {}
};

const list = [
"🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥🚨𝙽𝚐𝚞𝚢𝚎̂̃𝚗 𝚃𝚑𝚊𝚗𝚑 𝙿𝚑𝚞́ 𝚝𝚘̛́𝚒 𝚍𝚞𝚢𝚎̣̂𝚝 𝚕𝚞̃ đ𝚞́ 𝚖𝚡𝚑 𝚗𝚊̀𝚢 𝚖𝚊̀ 💤💦💨💥💯✨💫🔥 by 𝗡𝗴𝘂𝘆𝗲̂̃𝗻 𝗧𝗵𝗮𝗻𝗵 𝗣𝗵𝘂́👺",
];

let index = 0;
let isStopped = false;

export function onCall({ message }) {
  const args = message.body.split(" ").slice(1); 
  if (args[0] === "off") {
    isStopped = true; 
    message.send("Tắt Thành Công ✅");
    return;
  }

  if (isStopped) {
    isStopped = false;
  }

  const sendText = () => {
    message.send(list[index]);
    index = (index + 1) % list.length;
    if (!isStopped) {
      setTimeout(sendText, 12000); 
    }
  };
  sendText();
}

export default {
  config,
  onCall
};